app/Http/Controllers/HomeController.php

    public function search() {
        $school_dist_Lists = ResProperties::select(DB::raw('DISTINCT SCHOOLDISTRICT'))
            ->where('LISTSTATUS','Active')
            ->orderBy('SCHOOLDISTRICT', 'asc')
            ->get();
        //dd($school_dist_Lists);

        $propLists = ResProperties::where('LISTSTATUS','Active')->take(50)->get();
---
select DISTINCT SCHOOLDISTRICT from `res_properties` where `LISTSTATUS` = 'Active' order by `SCHOOLDISTRICT` asc
select * from `res_properties` where `LISTSTATUS` = 'Active' limit 50