app/Http/Controllers/PropertyController.php

select * from `crime_report` where `city` = 'Arlington' limit 1
---
    public function property_details(ResProperties $property) {

        $similarLists = ResProperties::where('CITY',$property->CITY)
            ->where('BEDS',$property->BEDS)
            ->where('BATHSFULL',$property->BATHSFULL)
            ->where('GARAGECAP',$property->GARAGECAP)
            ->where('MLSNUM','<>',$property->MLSNUM)
            ->whereBetween('SQFTTOTAL',[($property->SQFTTOTAL-300),($property->SQFTTOTAL+300)])->take(10)->get();
        //dd(DB::table('crime_report')->where('city',$property->CITY)->first());

        return view('property_details',[
            'property_info' => $property,
            'similarLists' => $similarLists,
            'crime_report' => DB::table('crime_report')->where('city',$property->CITY)->first()