app/Http/Controllers/PropertyController.php

select * from `res_properties` where `CITY` = 'Dallas' and `LISTSTATUS` = 'Sold' and `BEDS` = 4 and `BATHSFULL` = 2 and `GARAGECAP` = 2 and `MLSNUM` <> '13893455' and `LISTPRICE` between 1850000 and 2050000 and `SQFTTOTAL` between 2550 and 2950 limit 10
select `LISTPRICE` from `res_properties` where `CITY` = 'Dallas' and `ZIPCODE` = '75243' and `LISTSTATUS` = 'Sold' and `BEDS` = 4 and `BATHSFULL` = 2 and `GARAGECAP` = 2 and `MLSNUM` <> '13893455' and `SQFTTOTAL` between 2650 and 2850
---
    public function property_details(ResProperties $property) {

        $similarLists = ResProperties::where('CITY',$property->CITY)
            ->where('LISTSTATUS','Sold')
            ->where('BEDS',$property->BEDS)
            ->where('BATHSFULL',$property->BATHSFULL)
            ->where('GARAGECAP',$property->GARAGECAP)
            ->where('MLSNUM','<>',$property->MLSNUM)
            ->whereBetween('LISTPRICE',[($property->LISTPRICE-100000),($property->LISTPRICE+100000)])
            ->whereBetween('SQFTTOTAL',[($property->SQFTTOTAL-200),($property->SQFTTOTAL+200)])->take(10)->get();


        $similarPriceLists = ResProperties::select('LISTPRICE')
            ->where('CITY',$property->CITY)
            ->where('ZIPCODE',$property->ZIPCODE)
            ->where('LISTSTATUS','Sold')
            ->where('BEDS',$property->BEDS)
            ->where('BATHSFULL',$property->BATHSFULL)
            ->where('GARAGECAP',$property->GARAGECAP)
            ->where('MLSNUM','<>',$property->MLSNUM)
            ->whereBetween('SQFTTOTAL',[($property->SQFTTOTAL-100),($property->SQFTTOTAL+100)])->get();

select * from `crime_report` where `city` = 'Dallas' limit 1
---
                $final_estimated_price = $estimated_price/$similarPriceLists->count();
        }

        return view('property_details',[
            'property_info' => $property,
            'similarLists' => $similarLists,
            'estimated_price' => round($final_estimated_price),
            'crime_report' => DB::table('crime_report')->where('city',$property->CITY)->first()
        ]);