app/Http/Controllers/UserController.php

        $user->have_children = $request->input('have_children');
        $user->profession = $request->input('profession');

        $user->save();
---
insert into `users` (`first_name`, `last_name`, `email`, `password`, `age`, `marital_status`, `have_children`, `profession`, `updated_at`, `created_at`) values ('Ramon', 'Miles', 'miles@gmail.com', '$2y$10$qNBBpLw7Dmb2xSd3GxwDvewg7c0m0Y/ZbE.tT0UC7y/7K9IeiTG8e', '50', 'Unmarried', 'No', 'Teacher', '2021-12-16 02:21:25', '2021-12-16 02:21:25')